[
  {
    "id": 1,
    "name": "Portfolio",
    "image": "/preview/portfolioKF.jpg",
    "webside": "https://portfolio-kf.netlify.app/",
    "code": "https://github.com/katarzynaFronc/Portfolio",
    "description": "This project is an elegant and interactive showcase of my work. I used React, TypeScript and Vite to create it. It was designed with a modern aesthetic, using Sass for styling and Material-UI components for a clean and professional look.\nThe portfolio is not only a collection of my past work, but also a showcase of my ability to create efficient and user-friendly applications.\nOne of the standout features is the integrated email form, which uses EmailJS to send messages directly from the contact page without the need for a backend. This feature simplifies the communication process and ensures that potential clients or employers can easily contact me.\nThe portfolio demonstrates my ability to use the latest technologies and best practices in web development, providing visitors with a seamless experience and showcasing my expertise in React and TypeScript."
  },
  {
    "id": 2,
    "name": "ScrapStore",
    "image": "/preview/scrapStore.jpg",
    "webside": "https://e-commerce-kf.netlify.app/",
    "code": "https://github.com/katarzynaFronc/E-commerce",
    "description": "The app is a responsive headless e-commerce platform  that I built using React, Next.js and TypeScript. It is backed by Sanity Studio for content management, providing real-time collaboration and accurate content search. Payments are securely handled by Stripe, making the payment process a breeze. I used Bootstrap components along with Sass preprocessor styling.\nHere's a quick usage example: a customer visits the site, browses products, sorts or filters and selects an item to purchase. He adds the product to his shopping cart, proceeds to checkout and completes the transaction using Stripe. The headless nature of the application means that the front-end and back-end are separated, providing flexibility and scalability.\nThe simplicity and modernity of the app make it a great choice for online shopping, offering a seamless experience from finding a product to completing the transaction."
  },
  {
    "id": 3,
    "name": "LeafLoveApp",
    "image": "/preview/leafLove.jpg",
    "webside": "https://leaflove-34762.bubbleapps.io/version-test",
    "code": "https://leaflove-34762.bubbleapps.io/version-test",
    "description": "LeafLoveApp is an innovative platform that was created during a hackathon of social and environmental apps. Its main goal is to improve the quality of life by integrating care for the environment with concern for people's health, covering both public spaces and private environments.\nThe app specializes in promoting the presence of plants in various spaces - from balconies and terraces to residential and office interiors. The initiative has a direct impact on both air quality and the mental well-being of users. The platform creates a distinctive collaborative network, connecting people who need help with plant care with local gardening specialists.\nUsers benefit from comprehensive services, from one-on-one consultation sessions to ongoing support in plant maintenance, including the design and implementation phases. The system makes it easy to easily find an expert, and also provides a registration option for passionate gardeners eager to share their knowledge and experience.\nThe LeafLoveApp was developed using the Bubble.io no-code platform during two intensive hackathon sessions. Its value was recognized by the organizers of Hack4change 2024, who awarded it in the “continuing project” category, confirming its significant transformative potential and impact on the community."
  },
  {
    "id": 4,
    "name": "RentMe",
    "image": "/preview/rentMe.jpg",
    "webside": "https://rent-me.netlify.app/",
    "code": "https://github.com/katarzynaFronc/jfdzr9-team-ArchITects-of-the-safe-Universe",
    "description": "RentMe is an app that my team and I wrote at the end of the course. By sharing everyday items with other users in the neighborhood, it helps you fulfill your needs without spending money.\nWe used the React library and TypeScript to write the app. For styling, we used styled-components. As a backend, we used Firebase to store products, app reviews and create a user account.\nIn the project I was responsible for the implementation:\n- basic functions of adding products to the database and downloading them\n- Input components and basic styles for Button components using styled-components\n- routing\n- dark mode\n- RWD - responsiveness of the website\n- styling of selected subpages"
  },
  {
    "id": 5,
    "name": "Kfaf-fotografia",
    "image": "/preview/kfafFotografia.jpg",
    "webside": "https://kfaf-fotografia.netlify.app/",
    "code": "https://github.com/katarzynaFronc/KFAF-Fotografia",
    "description": "This website, which I created in 2010 for my own business, is a snapshot of my early days of web development. It is a showcase of my photographic work. By design, the site is intended to help potential clients learn about my style of work, view sample images, read feedback from other clients and contact me.\nThe website is written in HTML and CSS. I used a gallery from the JQuery library to present photos. The 'contact' tab gives you the opportunity to write me an email directly from the email application.\nThis is a very simple site that I wrote without any substantive preparation, only with the help of tutorials available on the Internet at the time.\nThis year I republished the website to show contrast between my 2010 website and my current work underscores the growth I have achieved, not only in technical skills, but also in effective communication and user experience design. This evolution is a testament to my commitment to continuous learning and the dynamic nature of web development."
  }
]
